#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.deploy: Reading...
module.website.data.aws_iam_policy_document.website_iam_policy: Reading...
data.aws_iam_openid_connect_provider.this: Reading...
module.website.data.aws_iam_policy_document.website_iam_policy: Read complete after 0s [id=1028062859]
data.aws_iam_policy_document.deploy: Read complete after 0s [id=2445177201]
module.website.aws_s3_bucket.website_bucket: Refreshing state... [id=araltiparmak-developer-portfolio]
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.oidc: Reading...
data.aws_iam_policy_document.oidc: Read complete after 0s [id=3870209556]
module.website.aws_s3_bucket_public_access_block.example: Refreshing state... [id=araltiparmak-developer-portfolio]
module.website.aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=araltiparmak-developer-portfolio]
module.website.aws_s3_bucket_website_configuration.website_configuration: Refreshing state... [id=araltiparmak-developer-portfolio]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy used for deployments on CI"
      + id               = (known after apply)
      + name             = "ci-deploy-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::araltiparmak-developer-portfolio/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Repo"      = "developer-portfolio"
        }
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:araltiparmak/araltiparmak-developer-portfolio:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_oidc_role_araltiparmak-developer-portfolio"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Repo"      = "developer-portfolio"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach-deploy will be created
  + resource "aws_iam_role_policy_attachment" "attach-deploy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "github_oidc_role_araltiparmak-developer-portfolio"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @araltiparmak, Action: `pull_request`*